Repository: Wujuhu/Codexio
Catalog: macos/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# 参考估值
source: Reference estimate
zh_hans: 参考估值

# 对比为缓存命中率的相对变化。
source: Comparison shows the relative change in cache hit rate.
zh_hans: 对比为缓存命中率的相对变化。

# 已检测 %s / %s 次调用 请求模型：%s
source: Observed %s / %s calls Requested model: %s
zh_hans: 已检测 %s / %s 次调用 请求模型：%s

# 截止时间：
source: Expires:
zh_hans: 截止时间：

# 按已确认数据计算
source: Based on confirmed records
zh_hans: 按已确认数据计算

# 旧日志缺少开始标记，按首次计量时间归属。
source: Older logs lack a start marker; assigned to the first recorded usage time.
zh_hans: 旧日志缺少开始标记，按首次计量时间归属。

# 结束时间：
source: Ended at:
zh_hans: 结束时间：

# 部分未定价
source: Some calls are unpriced
zh_hans: 部分未定价

# 金额仅含已定价部分，%s Token 尚未定价
source: Amount includes priced calls only; %s tokens are unpriced
zh_hans: 金额仅含已定价部分，%s Token 尚未定价

# · 保留 %s 的成功快照
source: · Retaining the successful snapshot from %s
zh_hans: · 保留 %s 的成功快照

# · 包含 %d 个子代理
source: · Includes %d subagents
zh_hans: · 包含 %d 个子代理

# · 已重启 Codex 客户端
source: · Codex restarted
zh_hans: · 已重启 Codex 客户端

# · 每页 100 条
source: · 100 rows per page
zh_hans: · 每页 100 条

# · 请自行重启 Codex 客户端
source: · Reopen Codex to apply the change
zh_hans: · 请自行重启 Codex 客户端

# · 配置生效状态待确认
source: · Configuration application is unconfirmed
zh_hans: · 配置生效状态待确认

# 剩余
source: remaining
zh_hans: 剩余

# %.1f 秒
source: %.1f s
zh_hans: %.1f 秒

# %.2f 秒
source: %.2f s
zh_hans: %.2f 秒

# %d 分钟前
source: %d minutes ago
zh_hans: %d 分钟前

# %d 天
source: %d days
zh_hans: %d 天

# %d 天后到期
source: Expires in %d days
zh_hans: %d 天后到期

# %d 小时后到期
source: Expires in %d hours
zh_hans: %d 小时后到期

# %d 条调用
source: %d calls
zh_hans: %d 条调用

# %d 条调用 · %d / %d 页
source: %d calls · %d / %d pages
zh_hans: %d 条调用 · %d / %d 页

# %d 次请求未定价
source: %d requests are unpriced
zh_hans: %d 次请求未定价

# %d分%02d秒
source: %dm %02ds
zh_hans: %d分%02d秒

# %d天%02d时%02d分
source: %dd %02dh %02dm
zh_hans: %d天%02d时%02d分

# %d时%02d分%02d秒
source: %dh %02dm %02ds
zh_hans: %d时%02d分%02d秒

# %s 缓存 %s
source: %s Cached %s
zh_hans: %s 缓存 %s

# %s %s 重置 %s
source: %s %s Resets %s
zh_hans: %s %s 重置 %s

# %s / %s · 共 %s 条
source: %s / %s · %s rows
zh_hans: %s / %s · 共 %s 条

# %s Token 未定价；当前金额仅含已定价调用
source: %s tokens are unpriced; the amount includes priced calls only
zh_hans: %s Token 未定价；当前金额仅含已定价调用

# %s · %d 次
source: %s · %d calls
zh_hans: %s · %d 次

# %s · %s 条调用
source: %s · %s calls
zh_hans: %s · %s 条调用

# %s 天有记录 · %s
source: %s active days · %s
zh_hans: %s 天有记录 · %s

# %s 条未归属调用
source: %s unassigned calls
zh_hans: %s 条未归属调用

# %s 条模型调用记录
source: %s model-call records
zh_hans: %s 条模型调用记录

# %s 条调用记录
source: %s call records
zh_hans: %s 条调用记录

# %s 次可用
source: %s available
zh_hans: %s 次可用

# %s 次独立子代理请求
source: %s independent subagent requests
zh_hans: %s 次独立子代理请求

# %s 次用户请求
source: %s user requests
zh_hans: %s 次用户请求

# %s 次调用
source: %s calls
zh_hans: %s 次调用

# --smoke-test 仅用于 macOS 的 --mock 验证
source: --smoke-test requires the isolated --mock mode
zh_hans: --smoke-test 仅用于 macOS 的 --mock 验证

# 0 / 0 · 共 0 条
source: 0 / 0 · 0 rows
zh_hans: 0 / 0 · 共 0 条

# 1 分钟
source: 1 minute
zh_hans: 1 分钟

# 1 天
source: 1 day
zh_hans: 1 天

# 10 分钟
source: 10 minutes
zh_hans: 10 分钟

# 10 秒
source: 10 seconds
zh_hans: 10 秒

# 30 分钟
source: 30 minutes
zh_hans: 30 分钟

# 30 秒
source: 30 seconds
zh_hans: 30 秒

# 5 分钟
source: 5 minutes
zh_hans: 5 分钟

# 5 小时
source: 5 hour
zh_hans: 5 小时

# 5 小时与周额度
source: 5-hour and weekly limits
zh_hans: 5 小时与周额度

# 5 小时额度
source: 5-hour limit
zh_hans: 5 小时额度

# 5 小时额度剩余
source: 5-hour allowance remaining
zh_hans: 5 小时额度剩余

# 5 秒
source: 5 seconds
zh_hans: 5 秒

# 60 分钟
source: 60 minutes
zh_hans: 60 分钟

# API 基础价 × Codex 倍率
source: API base price × Codex multiplier
zh_hans: API 基础价 × Codex 倍率

# Codex app-server 未启动
source: Codex app-server is not running
zh_hans: Codex app-server 未启动

# Codex 刻度额度
source: Codex Segmented Allowance
zh_hans: Codex 刻度额度

# Codex 单额度
source: Codex Weekly Allowance
zh_hans: Codex 单额度

# Codex 双额度
source: Codex Dual Allowance
zh_hans: Codex 双额度

# Codex 可执行文件
source: Codex executable
zh_hans: Codex 可执行文件

# Codex 可执行文件或 .app 路径
source: Codex executable or .app path
zh_hans: Codex 可执行文件或 .app 路径

# Codex 将通过本机转发请求，仅记录响应中的模型名称。更改路由后需要重新打开 Codex 才能让现有会话使用新配置。
source: Codex requests will pass through a local relay that records only response model names. Reopen Codex after the route changes to apply the configuration to existing sessions.
zh_hans: Codex 将通过本机转发请求，仅记录响应中的模型名称。更改路由后需要重新打开 Codex 才能让现有会话使用新配置。

# Codex 尚未连接
source: Codex is not connected
zh_hans: Codex 尚未连接

# Codex 用量统计与桌面交互优化
source: Codex usage and desktop interface updates
zh_hans: Codex 用量统计与桌面交互优化

# Codex 组件启动失败，将尝试其他安装位置：%s (%s)
source: Codex could not start; trying another installation: %s (%s)
zh_hans: Codex 组件启动失败，将尝试其他安装位置：%s (%s)

# Codex 组件无法启动：%s
source: Codex could not start: %s
zh_hans: Codex 组件无法启动：%s

# Codex 组件路径
source: Codex executable
zh_hans: Codex 组件路径

# Codex 请求超时
source: Codex request timed out
zh_hans: Codex 请求超时

# Codex 返回错误
source: Codex returned an error
zh_hans: Codex 返回错误

# Codex 连接已关闭
source: Codex connection closed
zh_hans: Codex 连接已关闭

# Codex 配置不是有效 TOML
source: Codex configuration is not valid TOML
zh_hans: Codex 配置不是有效 TOML

# Codex 配置不是有效 TOML，已保留原文件
source: Codex configuration is not valid TOML; the original file is retained
zh_hans: Codex 配置不是有效 TOML，已保留原文件

# Codex 配置同时发生变化，已保留转发，请重试恢复
source: Codex configuration changed concurrently; the relay is retained. Retry restoring it.
zh_hans: Codex 配置同时发生变化，已保留转发，请重试恢复

# Codex 配置同时发生变化，未进行接管，请重试
source: Codex configuration changed concurrently; no route was changed. Try again.
zh_hans: Codex 配置同时发生变化，未进行接管，请重试

# Codex 额度
source: Codex Allowance
zh_hans: Codex 额度

# Codexio · Codex 额度 1 week %s
source: Codexio · Codex allowance Weekly %s
zh_hans: Codexio · Codex 额度 1 week %s

# Codexio · Codex 额度 5 hours %s · 1 week %s
source: Codexio · Codex allowance 5 hours %s · Weekly %s
zh_hans: Codexio · Codex 额度 5 hours %s · 1 week %s

# Codexio 已应用上游检测设置
source: Codexio applied upstream detection settings
zh_hans: Codexio 已应用上游检测设置

# Codexio 已恢复模型服务配置
source: Codexio restored the provider configuration
zh_hans: Codexio 已恢复模型服务配置

# Codexio 正在安装更新
source: A Codexio installation is already in progress
zh_hans: Codexio 正在安装更新

# Codexio 请求
source: Codexio Request
zh_hans: Codexio 请求

# Codexio：本机 Codex 额度与用量统计
source: Codexio: local Codex allowance and usage
zh_hans: Codexio：本机 Codex 额度与用量统计

# Fast 模式
source: Fast mode
zh_hans: Fast 模式

# GitHub 暂时限制请求，请稍后重试
source: GitHub is temporarily limiting requests. Try again later.
zh_hans: GitHub 暂时限制请求，请稍后重试

# GitHub 请求失败（HTTP %s）
source: GitHub request failed (HTTP %s)
zh_hans: GitHub 请求失败（HTTP %s）

# GitHub 返回了无效的版本信息
source: GitHub returned invalid release information
zh_hans: GitHub 返回了无效的版本信息

# GitHub 返回的版本信息过大
source: The release information from GitHub is too large
zh_hans: GitHub 返回的版本信息过大

# HTTP 状态
source: HTTP status
zh_hans: HTTP 状态

# OpenAI API Standard 标准价
source: OpenAI API Standard price
zh_hans: OpenAI API Standard 标准价

# Qt 拒绝内嵌字体，回退系统字体: %s
source: Qt rejected the bundled font; using the system font: %s
zh_hans: Qt 拒绝内嵌字体，回退系统字体: %s

# Token 使用详情
source: Token usage details
zh_hans: Token 使用详情

# Token 分项不一致，未计算金额
source: Token components are inconsistent; cost is unavailable
zh_hans: Token 分项不一致，未计算金额

# Token 分项不是非负整数
source: Token components must be nonnegative integers
zh_hans: Token 分项不是非负整数

# Token 和费用趋势
source: Token and cost trends
zh_hans: Token 和费用趋势

# Token 总数
source: Total tokens
zh_hans: Token 总数

# Token 暂无有效数据
source: No confirmed token data
zh_hans: Token 暂无有效数据

# Token 构成
source: Token breakdown
zh_hans: Token 构成

# Token 活动
source: Token activity
zh_hans: Token 活动

# Total Token 暂无有效数据
source: Total tokens No confirmed data
zh_hans: Total Token 暂无有效数据

# Total Token 与价格使用趋势，可点击底部图例切换曲线
source: Token and cost trends; select a series in the legend
zh_hans: Total Token 与价格使用趋势，可点击底部图例切换曲线

# YYYY-MM-DD，可留空
source: YYYY-MM-DD, optional
zh_hans: YYYY-MM-DD，可留空

# ZIP 包含不安全的文件路径
source: The ZIP contains an unsafe path
zh_hans: ZIP 包含不安全的文件路径

# ZIP 缺少完整的 Codexio.app
source: The ZIP does not contain a complete Codexio.app
zh_hans: ZIP 缺少完整的 Codexio.app

# ZIP 解压大小超过限制
source: The ZIP exceeds the extraction size limit
zh_hans: ZIP 解压大小超过限制

# base_url 不得包含账号、密码、查询参数或 fragment；请使用 provider 的认证字段或 query_params
source: base_url must not contain credentials, query parameters, or a fragment; use provider authentication fields or query_params
zh_hans: base_url 不得包含账号、密码、查询参数或 fragment；请使用 provider 的认证字段或 query_params

# {} 次请求未定价
source: {} requests are unpriced
zh_hans: {} 次请求未定价

# — 次可用
source: — available
zh_hans: — 次可用

# 一
source: M
zh_hans: 一

# 一二三四五六日
source: MTWTFSS
zh_hans: 一二三四五六日

# 三
source: W
zh_hans: 三

# 上一次重置结果待确认，请重试本次
source: The previous reset result is unconfirmed. Retry the same reset.
zh_hans: 上一次重置结果待确认，请重试本次

# 上一页
source: Previous
zh_hans: 上一页

# 上下文
source: Context
zh_hans: 上下文

# 上次更新：
source: Last updated:
zh_hans: 上次更新：

# 上次路由尚未恢复，请先完成恢复
source: The previous route has not been restored. Restore it first.
zh_hans: 上次路由尚未恢复，请先完成恢复

# 上游检测
source: Upstream detection
zh_hans: 上游检测

# 上游检测仅支持 Responses API
source: Upstream detection supports the Responses API only
zh_hans: 上游检测仅支持 Responses API

# 上游检测仅支持 Responses API 模型供应商
source: Upstream detection supports Responses API providers only
zh_hans: 上游检测仅支持 Responses API 模型供应商

# 上游检测只能使用本机回环代理
source: Upstream detection requires a local loopback relay
zh_hans: 上游检测只能使用本机回环代理

# 上游检测已开启
source: Upstream detection is enabled
zh_hans: 上游检测已开启

# 上游检测正在切换，稍后再更新
source: Upstream detection is switching. Try updating later.
zh_hans: 上游检测正在切换，稍后再更新

# 上游路由恢复记录无效，已保留转发
source: Invalid route recovery data; the relay is retained
zh_hans: 上游路由恢复记录无效，已保留转发

# 上游路由恢复记录校验失败，已保留转发
source: Route recovery verification failed; the relay is retained
zh_hans: 上游路由恢复记录校验失败，已保留转发

# 上游路由未能恢复
source: The upstream route could not be restored
zh_hans: 上游路由未能恢复

# 上游路由被外部修改，已保留转发；请重试恢复
source: The route was changed externally. The relay is retained; retry restoration.
zh_hans: 上游路由被外部修改，已保留转发；请重试恢复

# 上移
source: Move up
zh_hans: 上移

# 下一页
source: Next
zh_hans: 下一页

# 下移
source: Move down
zh_hans: 下移

# 下载未完成，请检查网络和磁盘空间后重试
source: The download did not finish. Check the network and available disk space.
zh_hans: 下载未完成，请检查网络和磁盘空间后重试

# 不可用
source: Unavailable
zh_hans: 不可用

# 不贴边
source: None
zh_hans: 不贴边

# 两源单价冲突，保留已有价格
source: Price sources disagree; saved prices are retained
zh_hans: 两源单价冲突，保留已有价格

# 两源单价冲突，保留已有价格:
source: Price sources disagree; saved prices retained:
zh_hans: 两源单价冲突，保留已有价格:

# 个人计划
source: Personal plan
zh_hans: 个人计划

# 个人订阅
source: Personal subscription
zh_hans: 个人订阅

# 个人订阅计划
source: Personal plan
zh_hans: 个人订阅计划

# 个人订阅资料
source: Subscription profile
zh_hans: 个人订阅资料

# 中等
source: Medium
zh_hans: 中等

# 主动重置
source: Rate-limit resets
zh_hans: 主动重置

# 主界面主题
source: Theme
zh_hans: 主界面主题

# 主题
source: Theme
zh_hans: 主题

# 五
source: F
zh_hans: 五

# 仅使用本地日志与同期额度观测估值；非订阅实际扣款。
source: Estimated from local logs and corresponding allowance observations; not subscription charges.
zh_hans: 仅使用本地日志与同期额度观测估值；非订阅实际扣款。

# 仅合并能够明确归属的子代理调用
source: Only subagent calls with confirmed ownership are grouped
zh_hans: 仅合并能够明确归属的子代理调用

# 仅周额度
source: Weekly only
zh_hans: 仅周额度

# 仅图标
source: Icon only
zh_hans: 仅图标

# 仅显示额度，提供三种样式
source: Allowance only, with three styles
zh_hans: 仅显示额度，提供三种样式

# 仅统计本机记录
source: Computed from local records only
zh_hans: 仅统计本机记录

# 今天
source: Today
zh_hans: 今天

# 今天 %s
source: Today %s
zh_hans: 今天 %s

# 今日
source: Today
zh_hans: 今日

# 今日 %s Token %s
source: Today %s tokens %s
zh_hans: 今日 %s Token %s

# 今日 Token
source: Today’s tokens
zh_hans: 今日 Token

# 今日命中率
source: Today’s cache hit
zh_hans: 今日命中率

# 今日总 Token
source: Today's total tokens
zh_hans: 今日总 Token

# 今日总费用
source: Today's total cost
zh_hans: 今日总费用

# 今日用量
source: Today’s usage
zh_hans: 今日用量

# 今日请求数
source: Today’s requests
zh_hans: 今日请求数

# 今日费用
source: Today’s cost
zh_hans: 今日费用

# 从
source: From
zh_hans: 从

# 从主请求发起到整轮结束，包含工具等待；并行子代理不重复相加。
source: From the main request start to the end of the turn, including tool waits; parallel subagents are not added twice.
zh_hans: 从主请求发起到整轮结束，包含工具等待；并行子代理不重复相加。

# 代理已停止并恢复配置，请重新开启上游检测
source: The relay stopped and the configuration was restored. Enable upstream detection again.
zh_hans: 代理已停止并恢复配置，请重新开启上游检测

# 价格
source: Price
zh_hans: 价格

# 价格同步失败，保留已有价格
source: Price sync failed; saved prices are retained
zh_hans: 价格同步失败，保留已有价格

# 价格待补齐
source: Prices incomplete
zh_hans: 价格待补齐

# 价格目录中没有有效的 OpenAI 模型价格
source: No valid OpenAI model prices in the catalog
zh_hans: 价格目录中没有有效的 OpenAI 模型价格

# 价格目录无有效内容
source: No valid prices in the catalog
zh_hans: 价格目录无有效内容

# 价格目录超过大小限制
source: The price catalog exceeds the size limit
zh_hans: 价格目录超过大小限制

# 任务记录
source: Task record
zh_hans: 任务记录

# 任意位置拖动可移动窗口，边缘拖动可调节大小，右键打开菜单
source: Drag to move, drag edges to resize, or right-click for the menu
zh_hans: 任意位置拖动可移动窗口，边缘拖动可调节大小，右键打开菜单

# 优化 Codexio 的日志详情与额度显示
source: Refine Codexio log details and allowance display
zh_hans: 优化 Codexio 的日志详情与额度显示

# 优化日志详情与用量统计
source: Refine log details and usage statistics
zh_hans: 优化日志详情与用量统计

# 会话：
source: Chat:
zh_hans: 会话：

# 使用日志明确记录的本次调用耗时，不用相邻调用间隔推算。
source: Uses the duration recorded for this call, without inferring it from adjacent calls.
zh_hans: 使用日志明确记录的本次调用耗时，不用相邻调用间隔推算。

# 使用日志明确记录的调用计时，不以相邻调用间隔代替。
source: Uses explicit call timing from logs; adjacent-call intervals are not substituted.
zh_hans: 使用日志明确记录的调用计时，不以相邻调用间隔代替。

# 使用模拟额度数据，不启动 app-server
source: Use mock allowance data without starting app-server
zh_hans: 使用模拟额度数据，不启动 app-server

# 使用这次额度重置？
source: Use this reset?
zh_hans: 使用这次额度重置？

# 使用重置
source: Use reset
zh_hans: 使用重置

# 侧边栏
source: Sidebar
zh_hans: 侧边栏

# 保存
source: Save
zh_hans: 保存

# 保留当前模型供应商与认证方式。仅显示响应实际返回的模型型号，历史请求无法补查；退出 Codexio 会恢复配置。
source: Keeps the current provider and authentication. Shows model names reported by responses; older requests cannot be backfilled. Quitting Codexio restores the configuration.
zh_hans: 保留当前模型供应商与认证方式。仅显示响应实际返回的模型型号，历史请求无法补查；退出 Codexio 会恢复配置。

# 保留恢复记录并退出
source: Keep recovery data and quit
zh_hans: 保留恢复记录并退出

# 倍率：Fast 消耗速度为 2.5 倍。超过 272K 上下文时，除 GPT-6 Astra 外，输入和缓存为 2 倍，输出为1.5 倍。
source: Fast uses 2.5×. Above 272K context, models other than GPT-6 Astra use 2× input and cached-input rates and 1.5× output rates.
zh_hans: 倍率：Fast 消耗速度为 2.5 倍。超过 272K 上下文时，除 GPT-6 Astra 外，输入和缓存为 2 倍，输出为1.5 倍。

# 光球
source: Orb
zh_hans: 光球

# 全账号范围
source: Account-wide
zh_hans: 全账号范围

# 全选
source: Select All
zh_hans: 全选

# 全部
source: All
zh_hans: 全部

# 全部历史
source: All history
zh_hans: 全部历史

# 全部档位
source: All tiers
zh_hans: 全部档位

# 全部模型
source: All models
zh_hans: 全部模型

# 全部状态
source: All statuses
zh_hans: 全部状态

# 全部速度
source: All speeds
zh_hans: 全部速度

# 关于 Codexio
source: About Codexio
zh_hans: 关于 Codexio

# 关联说明
source: Attribution
zh_hans: 关联说明

# 关联输入 / 计量时间
source: Prompt / metering time
zh_hans: 关联输入 / 计量时间

# 关闭
source: Disable
zh_hans: 关闭

# 关闭 app-server 失败
source: Could not close app-server
zh_hans: 关闭 app-server 失败

# 关闭上游检测？
source: Disable upstream detection?
zh_hans: 关闭上游检测？

# 关闭悬浮窗
source: Hide floating window
zh_hans: 关闭悬浮窗

# 关闭窗口
source: Close window
zh_hans: 关闭窗口

# 其中推理 Token
source: Reasoning tokens included
zh_hans: 其中推理 Token

# 其中缓存读取
source: Cached input included
zh_hans: 其中缓存读取

# 内嵌字体不可用，界面改用系统字体
source: Bundled font unavailable; using the system font
zh_hans: 内嵌字体不可用，界面改用系统字体

# 内嵌字体没有可用族名，回退系统字体: %s
source: Bundled font has no usable family; using the system font: %s
zh_hans: 内嵌字体没有可用族名，回退系统字体: %s

# 写入额度缓存失败
source: Could not write the allowance cache
zh_hans: 写入额度缓存失败

# 减少
source: Decrease
zh_hans: 减少

# 切换侧边栏
source: Toggle sidebar
zh_hans: 切换侧边栏

# 刚刚
source: Just now
zh_hans: 刚刚

# 刷
source: Refresh
zh_hans: 刷

# 刷新
source: Refresh
zh_hans: 刷新

# 刷新与估算
source: Refresh and estimates
zh_hans: 刷新与估算

# 刷新数据
source: Refresh data
zh_hans: 刷新数据

# 刷新明细
source: Refresh details
zh_hans: 刷新明细

# 刷新额度与用量
source: Refresh allowance and usage
zh_hans: 刷新额度与用量

# 前期为 0
source: Previous period was 0
zh_hans: 前期为 0

# 剩余
source: Remaining
zh_hans: 剩余

# 剩余 %s；%s；%s
source: %s remaining; %s; %s
zh_hans: 剩余 %s；%s；%s

# 剩余时间
source: Time left
zh_hans: 剩余时间

# 剩余额度
source: Remaining allowance
zh_hans: 剩余额度

# 剪切
source: Cut
zh_hans: 剪切

# 加载内嵌字体失败，回退系统字体: %s
source: Could not load the bundled font; using the system font: %s
zh_hans: 加载内嵌字体失败，回退系统字体: %s

# 包含已明确关联的子代理；只有整轮结束后才显示完成。
source: Includes confirmed subagents; completes when the whole turn ends.
zh_hans: 包含已明确关联的子代理；只有整轮结束后才显示完成。

# 包含模型
source: Models included
zh_hans: 包含模型

# 单价无效
source: Invalid price
zh_hans: 单价无效

# 单日峰值 Token
source: Peak daily tokens
zh_hans: 单日峰值 Token

# 单额度
source: Single limit
zh_hans: 单额度

# 单额度窗口
source: Single-limit window
zh_hans: 单额度窗口

# 占每周限额的 %
source: % of weekly limit
zh_hans: 占每周限额的 %

# 卡片
source: Cards
zh_hans: 卡片

# 历史
source: All time
zh_hans: 历史

# 原始记录未提供明确服务档位，按默认 Standard 标准价估计
source: Service tier was not recorded; estimated at the Standard price
zh_hans: 原始记录未提供明确服务档位，按默认 Standard 标准价估计

# 原请求小组件 · 小 / 中 / 大
source: Existing request widgets · small / medium / large
zh_hans: 原请求小组件 · 小 / 中 / 大

# 双环
source: Dual rings
zh_hans: 双环

# 双额度
source: Dual limits
zh_hans: 双额度

# 双额度刻度条
source: Segmented dual limits
zh_hans: 双额度刻度条

# 发现新版 %s，正在下载…
source: Version %s is available. Downloading…
zh_hans: 发现新版 %s，正在下载…

# 发起时间
source: Started
zh_hans: 发起时间

# 发起时间：
source: Started at:
zh_hans: 发起时间：

# 取消
source: Cancel
zh_hans: 取消

# 取消停靠
source: Undock
zh_hans: 取消停靠

# 取消选择
source: Cancel selection
zh_hans: 取消选择

# 另一个 Codexio 正在使用上游检测
source: Another Codexio instance is using upstream detection
zh_hans: 另一个 Codexio 正在使用上游检测

# 另一个上游检测操作正在修改配置，请稍后重试
source: Another operation is changing the provider configuration. Try again later.
zh_hans: 另一个上游检测操作正在修改配置，请稍后重试

# 另有 %d 次可用，接口尚未返回对应明细。
source: %d additional resets are available, but their details were not returned.
zh_hans: 另有 %d 次可用，接口尚未返回对应明细。

# 只修改 Standard 基础价。Fast 与长上下文价格按 Codex 规则生成，并同步到所有费用。手工基础价在自动同步后保留。
source: Edit Standard base prices only. Fast and long-context prices are derived using Codex rules and applied to all cost estimates. Manual base prices survive automatic synchronization.
zh_hans: 只修改 Standard 基础价。Fast 与长上下文价格按 Codex 规则生成，并同步到所有费用。手工基础价在自动同步后保留。

# 只显示服务端已提供的重置明细
source: Only reset details returned by the service are shown
zh_hans: 只显示服务端已提供的重置明细

# 只编辑 Standard 基础价；Fast 与长上下文单价由 Codex 规则生成
source: Edit Standard base prices. Codex rules determine Fast and long-context prices.
zh_hans: 只编辑 Standard 基础价；Fast 与长上下文单价由 Codex 规则生成

# 只记录个人资料，不会变更实际订阅或产生扣款。
source: Personal records only; this does not change your subscription or create a charge.
zh_hans: 只记录个人资料，不会变更实际订阅或产生扣款。

source: Observes model names returned by Responses. Temporarily routes the current provider through a local relay and restores it on exit. You can restart Codex now or reopen it later to apply changes.
zh_hans: 可检测 Responses 上游实际返回的模型型号。该功能只把当前模型服务地址临时改为本机回环代理，退出时恢复；需要生效或无法确认时，可选择现在重启 Codex 客户端或稍后自行重启。

# 右侧
source: Right
zh_hans: 右侧

# 同步
source: Sync
zh_hans: 同步

# 同步时间：
source: Last sync:
zh_hans: 同步时间：

# 同步时间：暂无
source: Last sync: not yet synced
zh_hans: 同步时间：暂无

# 启动 Codexio
source: Starting Codexio
zh_hans: 启动 Codexio

# 启动后自动检查新版
source: Check for updates on startup
zh_hans: 启动后自动检查新版

# 启动时模型价格同步失败，沿用已缓存价格
source: Startup price sync failed; retaining cached prices
zh_hans: 启动时模型价格同步失败，沿用已缓存价格

# 周
source: Weekly
zh_hans: 周

# 周一
source: Monday
zh_hans: 周一

# 周三
source: Wednesday
zh_hans: 周三

# 周二
source: Tuesday
zh_hans: 周二

# 周五
source: Friday
zh_hans: 周五

# 周估值
source: Weekly estimate
zh_hans: 周估值

# 周六
source: Saturday
zh_hans: 周六

# 周四
source: Thursday
zh_hans: 周四

# 周日
source: Sunday
zh_hans: 周日

# 周期
source: Period
zh_hans: 周期

# 周期记录
source: Cycle history
zh_hans: 周期记录

# 周额度
source: Weekly limit
zh_hans: 周额度

# 周额度估值记录
source: Weekly allowance estimates
zh_hans: 周额度估值记录

# 周额度估算
source: Weekly allowance estimates
zh_hans: 周额度估算

# 周额度剩余
source: Weekly allowance remaining
zh_hans: 周额度剩余

# 命中率
source: Cache hit
zh_hans: 命中率

# 响应超过大小限制
source: Response exceeds the size limit
zh_hans: 响应超过大小限制

# 响应返回模型
source: Response model
zh_hans: 响应返回模型

# 响应返回的上游模型
source: Model reported by the upstream response
zh_hans: 响应返回的上游模型

# 回复中
source: Responding
zh_hans: 回复中

# 回复预览
source: Reply preview
zh_hans: 回复预览

# 固定首位
source: Always first
zh_hans: 固定首位

# 图标
source: Icon
zh_hans: 图标

# 图标 + 5 小时剩余
source: Icon + 5-hour remaining
zh_hans: 图标 + 5 小时剩余

# 图标 + 周额度剩余
source: Icon + weekly remaining
zh_hans: 图标 + 周额度剩余

# 图片
source: Image
zh_hans: 图片

# 圆环
source: Rings
zh_hans: 圆环

# 在 Finder 中打开
source: Show in Finder
zh_hans: 在 Finder 中打开

# 在菜单栏显示
source: Show in menu bar
zh_hans: 在菜单栏显示

# 增加
source: Increase
zh_hans: 增加

# 处理中
source: Processing
zh_hans: 处理中

# 备源核对暂不可用
source: Reference price verification is unavailable
zh_hans: 备源核对暂不可用

# 备源核对暂不可用:
source: Reference price verification is unavailable:
zh_hans: 备源核对暂不可用:

# 备源没有可核对的标准价格
source: The reference source has no Standard prices to verify
zh_hans: 备源没有可核对的标准价格

# 复制
source: Copy
zh_hans: 复制

# 外观
source: Appearance
zh_hans: 外观

# 多
source: More
zh_hans: 多

# 多上游（%d）
source: Multiple upstreams (%d)
zh_hans: 多上游（%d）

# 多个桌面客户端使用不同的 config.toml，请保留一个配置后再开启上游检测
source: Desktop clients use different config.toml files. Keep one configuration before enabling upstream detection.
zh_hans: 多个桌面客户端使用不同的 config.toml，请保留一个配置后再开启上游检测

# 多个桌面客户端使用不同的配置方案，请保留一个配置后再开启上游检测
source: Desktop clients use different profiles. Keep one profile before enabling upstream detection.
zh_hans: 多个桌面客户端使用不同的配置方案，请保留一个配置后再开启上游检测

# 天
source: days
zh_hans: 天

# 套餐
source: Plan
zh_hans: 套餐

# 套餐未识别
source: Plan unknown
zh_hans: 套餐未识别

# 套餐用量历史
source: Plan usage history
zh_hans: 套餐用量历史

# 如果不重启 Codex 客户端，旧路由可能仍在内存中。现在重启会中断正在进行的请求。
source: Without restarting Codex, the previous route may remain in memory. Restarting now interrupts active requests.
zh_hans: 如果不重启 Codex 客户端，旧路由可能仍在内存中。现在重启会中断正在进行的请求。

# 始终置顶
source: Always on top
zh_hans: 始终置顶

# 子代理
source: Subagent
zh_hans: 子代理

# 子代理 ·
source: Subagent ·
zh_hans: 子代理 ·

# 完成
source: Done
zh_hans: 完成

# 完成 Codexio 原生重构
source: Finish the Codexio native rebuild
zh_hans: 完成 Codexio 原生重构

# 定价
source: Pricing
zh_hans: 定价

# 实时预览
source: Live preview
zh_hans: 实时预览

# 客户端启动参数或环境变量覆盖了模型路由，未进行接管
source: Launch arguments or environment variables override the provider route; no changes were made
zh_hans: 客户端启动参数或环境变量覆盖了模型路由，未进行接管

# 客户端尚未退出，请在任务结束后自行重新打开
source: The client is still running; reopen it when the task finishes
zh_hans: 客户端尚未退出，请在任务结束后自行重新打开

# 客户端的 config.toml 路径已改变，请先关闭上游检测再重新开启
source: The Codex config.toml path changed. Disable upstream detection, then enable it again.
zh_hans: 客户端的 config.toml 路径已改变，请先关闭上游检测再重新开启

# 小组件数据已加载
source: Widget data loaded
zh_hans: 小组件数据已加载

# 小组件注册未完成，已保留原有注册
source: Widget registration did not complete; existing registrations are retained
zh_hans: 小组件注册未完成，已保留原有注册

# 少
source: Less
zh_hans: 少

# 尚无可见回复
source: No visible reply yet
zh_hans: 尚无可见回复

# 尚无当前 Codex 后台进程加载配置的可靠记录。可重启以确认生效，也可稍后自行重启。现在重启会中断正在进行的请求。
source: There is no reliable record that the current Codex backend loaded this configuration. Restart now to apply it or reopen Codex later. Restarting interrupts active requests.
zh_hans: 尚无当前 Codex 后台进程加载配置的可靠记录。可重启以确认生效，也可稍后自行重启。现在重启会中断正在进行的请求。

# 尚未更新
source: Not updated yet
zh_hans: 尚未更新

# 尚未读取逐次明细
source: Individual details have not been loaded
zh_hans: 尚未读取逐次明细

# 就绪
source: Ready
zh_hans: 就绪

# 展开导航栏
source: Expand sidebar
zh_hans: 展开导航栏

# 展开趋势
source: Expand trend
zh_hans: 展开趋势

# 左侧
source: Left
zh_hans: 左侧

# 已中断
source: Interrupted
zh_hans: 已中断

# 已使用限额百分比
source: Limit used
zh_hans: 已使用限额百分比

# 已停止加载
source: Loading stopped
zh_hans: 已停止加载
